Напишите программу, которая найдёт произведение пар 
чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
 Пример:
[2, 3, 4, 5, 6] => [12, 15, 16];
[2, 3, 5, 6] => [12, 15]

from random import Random, randint
N = int(input('Введите количество эллементов списка: '))
rnd = []
new = []
for i in range(N):rnd.append(randint(0, 10))
i=0
for i in range(N):
    if i < N / 2:
        new.append(rnd[i]*rnd[N-i-1])
print(f'Сформированный список{rnd}')
print(f'Произведение крайних пар {new}')
